const moment = require("moment-timezone");

module.exports.config = {
  name: "caption",
  version: "1.0.1",
  hasPermssion: 0,
  credits: "—͟͟͞͞𝐂𝐘𝐁𝐄𝐑 ☢️_𖣘 -𝐁𝐎𝐓 ⚠️ 𝑻𝑬𝑨𝑴_ ☢️",
  description: "random caption",
  commandCategory: "caption",
  usages: "caption",
  cooldowns: 5
};

module.exports.handleEvent = async function ({ api, event, Users }) {
  const { threadID, messageID, body, senderID } = event;

  if (!body || !body.toLowerCase().startsWith("caption")) return;

  const name = await Users.getNameUser(senderID);
  const time = moment.tz("Asia/Dhaka").format("HH:mm:ss L");

  const tl = [
    "- অনেকের নতুন মানুষ হয়েছে তারা ভালো থাকুক  আর আমার হঠাৎ মৃত্যু হোক তারা না জানুক🥹😭",
    "°\n\n -গল্পটা আসোলেই তখন ভালো ছিলো ......! যখন তুমি ছিলে অপরিচিত আর _ 🙂💔 আর আমি আমার আমিতেই সিমাবদ্ধ 🙂 🙂......!\n\n°",
    "দুঃখ দিলে‚প্রেম দিলে না‚‚!🌸 _নিখুঁতভাবে কাঁদিয়ে বললে আর কেঁদোনা‚‚!!😅❤️‍🩹",
    "যখন মায়া বাড়িয়ে লাভ হয় না,তখন মায়া কাটাতে শিখতে হয় _-⎯⃝😅",
    "নাই কোনো অভিমান-অভিযোগ, ভাল থাকুক সে𑁍❀☹️",
    "সময়ের পরিবর্তনে রাগ, অভিমান কমে যায়,\n\n-কিন্তু কারো দেয়া আঘাতের দাগ গুলা থেকে যায়..! 😌",
    "মানুষ মাঝে মাঝে রাগ করতে করতে রাগের কারনটাই ভুলে যায়\n\n°`-শুধু থেকে যায় কিছু অভিমান..! 😊🤗",
    "°<নীরবতারও ভাষা আছে,এটা\n\n-শুধু খুব কাছের কেউই বুঝতে পারে।😊🙏",
    "প্রেমের সম্পর্ক অনেকটা পদ্ম পাতার ওপর এক ফোঁটা জলের মতো\n\n°`<যত্ন না করলে যে কোনো সময় 𑁍ভেঙ্গে যেতে পারে..! 🥰🫶",
    "অভিমানী মন অভিমানী এই রয়ে যায়\n\nতবুও কেউ অভিমান ভাঙাতে আসেনা.. 😅🤗",
    "অন্যের ওপরে অভিমান করে নিজেকে কষ্ট দেওয়া মানুষগুলি মারাত্মক বোকা..! 😵💔",
    "হয়তো তোমাকে হারিয়ে দিয়েছি নয় তো গিয়েছি হেরে থাক না ধ্রুপদী অস্পষ্টতাকে কাকে গেলাম ছেড়ে..  _-⎯⃝  🩷",
    "মৃত্যুর মিছিলে যদি হারিয়ে যাই 😅 তাহলে আমায় ক্ষমা করে দিয়েন  দুহাত দিয়ে মাটি দিতে না পারলেও দুহাত  তুলে দোয়া করিয়েন 😅❤️‍🩹",
    "একমাত্র সৎ ব্যক্তিরাই অন্যকে কঠোরভাবে তিরস্কার করতে পারে😊🥰",
    "যে নদীর গভীরতা বেশি, তার বয়ে যাওয়ার শব্দ কম..!🤗",
    "তুমি যদি কোনো লোককে জানতে চাও\n\n-তাহলে তাকে প্রথমে ভালোবাসতে শেখো..!🥰",
    "সুন্দর একটা মানুষ না খুঁজে🤗\n\nসুন্দর একটা মন খুঁজো🥰\n\nতাহলে ভালোবাসার সফলতা আসবে..!😌",
    "প্রেম নারীর লজ্জাশীলতাকে গ্রাস করে\n\nপুরুষের বাড়ায়..!☠️🤝",
    "প্রেমের ক্ষেত্রে জয়ী হয়ে কেউ শিল্পী হতে পারে না\n\nবড় জোর বিয়ে করতে পারে..🤗",
    "একাকীত্ব তখনই মানুষ অনুভব করে\n\nযখন সে নিজের সাথে কথা বলে\n\nকারণ তখন কেউ তার কথা শোনার মত থাকে না..!🥰🫶",
    "বিচ্ছিন্নতার অনুভূতি সৃষ্টি করে একাকীত্ব..! _-✿︎\n\nযা পরিশেষে মানুষের জীবনকে চরম কষ্ট প্রদান করে.. _-⎯⃝ 🥰",
    "শূন্যতায় ভরা এ জগৎ সংসার\n\nসুখ-দুঃখ ভরা সব অতৃপ্তআত্না\n\n সুখ অনুভবে...তবু সুখ বলে কিছু নেই...দুঃখ সে তো শাশ্বত শূন্যের হাহাকার..!𑁍",
    "অসৎ মানুষের সঙ্গ লাভ করার থেকে নিঃসঙ্গতা ও একাকীত্ব অধিকতর শ্রেয়..!😊🤝",
    "কি দারুন অংক সেখালে নিজেকে অন্যের সাথে যোগ করে আমায় বিয়োগ করে ফলাফল শূন্য দেখালে😅💔☹️🫶",
    "Hoito Abar Dekha Hobe Kono Akdin Tomar Hat Ta Thakbe Onno Karo Hate, Chena Hoyeo Ochena Manusher Vire---💔😅😊💔",
    "আজকাল আমরা সবাই নিজের ego satisfy করতে ব্যস্ত..☹️",
    "মাঝে মাঝেই ভাবি যে ভালো হয়ে যাবো\n\n-তারপরেই মনে হয় আমি খারাপ ছিলাম কবে..?🥱",
    "Perfect না হতে পারি..!\n\nতবে সস্তা নয়..!🥱",
    "যে অন্যের দোষ তোমাকে বলে..🙃\n\nসে নিশ্চয়ই তোমার দোষও অপরকে বলে.!😊🙏",
    "আমাকে ভাই বলার অধিকার শুধু আমার বন্ধুদের আছে..!🥰\n\nনয়তো শত্রুরা আজও আমাকে বাবা বলে ডাকে..!🥱🤝",
    "অন্যের মুখে শোনা কথা তাড়াতাড়ি না বিশ্বাস করাই ভালো..কারণ সত্যের তুলনায় মিথ্যা দ্রুতই ছড়িয়ে পড়ে..!😊",
    "গল্পটা আসোলেই তখন ভালো ছিলো ......! যখন তুমি ছিলে অপরিচিত আর _ 🙂💔 আর আমি আমার আমিতেই সিমাবদ্ধ 🙂 🙂......!.!😌",
    "মৃত্যু যেখানে সময়ের ব্যাপার মাত্র..সেখানে রঙিন স্বপ্ন বড়ই বে মানান..😌🫶",
    "দক্ষতা জিনিসগুলি সঠিকভাবে করছে..কার্যকারিতা সঠিক জিনিসগুলি করছে🥰🤝",
    "মানুষ খুব কমই সফল হয় যদি না তারা যা করছে তাতে আনন্দ পায়😌🙏",
    "নিজেকে ইতিবাচক ব্যক্তিদের চারপাশে ঘিরে রাখুন তাহলে আপনিও একজন ইতিবাচক ব্যক্তি হবেন..😊🫶",
    "মন খারাপ গুলোকে..হাসির আঁড়ালে লুকিয়ে..রাখার অভ্যাসটা আজও ছাড়তে পারলাম না!😊💔",
    "ছোট একটা ভুলের জন্য যে\n\nচিরদিনের জন্য ছেড়ে চলে যায়..\n\nসে আসলে কখনো পাশে থাকার যোগ্যই ছিলো না..!😊🤝",
    "জানি সে আমার নয়..!😌তবু তাকে হারানোর ভয়..😊🙏",
    "ভুল হলে শুধরে দেওয়াটা হচ্ছে ভালোবাসা..!\n\nফেলে চলে যাওয়াটা হচ্ছে বেইমানি..!😌💔",
    "মুখোশধারী ভদ্র হওয়ার চেয়ে..!😵\n\nস্পষ্টবাদী অভদ্র হওয়া অনেক ভালো..!😌",
    "Dear Ex আজও তোর কথা মনে পড়লে ভাবি আমার Choice এতটা খারাপ ছিল..!🥴🥱",
    "জীবনে সব কিছুকে আঁকড়ে ধরতে নেই..!😊💔",
    "আমি স্বার্থপর নই!\n\n-শুধু তাদের থেকে দুরে সরে যাই..\n\nযাদের কাছে আমার কোনো মূল্য নেই..!😊🫶",
    "🐰: কিছু ব্যাথা শব্দহীন ভাবে ভেতরটা তছনছ করে দেয় 😅\nডিপ্রেশন 😓🥀",
    "– হারিয়ে ফেলেছি মানসিক শান্তি!🙂🥹",
    "❝༆কারো আলোকিত শহরে হাটতে চাইনাツ࿐🙂",
    "🦋🥀°এই শহরে সবার’ই কষ্ট আছে.!🙂\n°কেউ কেউ প্রকাশ করে, আর কেউ হাসির মাধ্যমে উড়িয়ে দেয়.!🙂🖤",
    "লাইফে এমন কিছু ডিপ্রেশন আছে😥\nযা সৃষ্টিকর্তা ছাড়া কারো কাছে প্রকাশ করা যায় না🤲🥀"
  ];

  const rand = tl[Math.floor(Math.random() * tl.length)];

  return api.sendMessage({ body: rand }, threadID, messageID);
};

module.exports.run = () => {};
